; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 561145 2 3 3 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
)
(:goal (and
	(have_image Phenomenon3 image1)
	(have_image Planet4 thermograph0)
	(have_image Star5 thermograph2)
	(have_image Planet6 image1)
	(have_image Planet7 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 planet4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet4)
   goals met: 0 of 5
4. (turn_to satellite1 groundstation0 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 5
5. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 5
6. (turn_to satellite0 planet7 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet7)
   goals met: 0 of 5
7. (turn_to satellite1 star5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
8. (turn_to satellite0 groundstation0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
9. (take_image satellite1 star5 instrument4 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 1 of 5
10. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 5
11. (turn_to satellite1 phenomenon3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon3)
   goals met: 1 of 5
12. (turn_to satellite0 planet4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet4)
   goals met: 1 of 5
13. (take_image satellite1 phenomenon3 instrument4 image1)
   added: (have_image phenomenon3 image1)
   goals met: 2 of 5
14. (take_image satellite0 planet4 instrument0 thermograph0)
   added: (have_image planet4 thermograph0)
   goals met: 3 of 5
15. (turn_to satellite1 planet6 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 planet6)
   goals met: 3 of 5
16. (turn_to satellite0 planet7 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet7)
   goals met: 3 of 5
17. (take_image satellite1 planet6 instrument4 image1)
   added: (have_image planet6 image1)
   goals met: 4 of 5
18. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 5 of 5
